README.org
#+TITLE: slang - S-Expression languages frontend
#+AUTHOR: kostdani
#+EMAIL: kostdani@mail.com

#+DESCRIPTION: Compiler frontend for S-Expression languages tageting LLVM IR
#+HOMEPAGE: https://github.com/kostdani/slang
#+KEYWORDS: llvm, s-expression, compiler, scheme, lisp, c
#+LANGUAGE: en
#+LICENSE: MIT

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args :comments both
#+PROPERTY: header-args :exports both

* Introduction

Slang is a compiler frontend for S-Expression languages targeting LLVM IR. It
is written in C and uses LLVM C API. It is designed to be used as a CLI tool.

* SEIR

SEIR stands for S-Expression Intermediate Representation. It is designed
to have s-expression syntax and as close to LLVM IR semantics as possible.
It is not intended to be used directly, but rather as a target language for
other S-Expression languages which they can be transformed to using macros.
Something liek assembly of lisps.

** Src
*** AST
:PROPERTIES:
:HEADER-ARGS: :tangle src/ast.h  :comments both :exports both :mkdirp yes
:END:

Abstract syntax tree is maximally simplified. There are 2 types of nodes:
- LIST - list of nodes
- ATOM - atom node (leaf) storing a string
  
#+BEGIN_SRC C
  #pragma once
  #include <stdio.h>
  #include <string.h>
  #include <malloc.h>

  typedef struct s_expr{
      enum{
          LIST,
          ATOM
      } type;
      void * ptr;
  } SExpr;

  void free_sexpr(SExpr sexp){
      if(sexp.type==LIST)
          for (SExpr *i = (SExpr *) sexp.ptr; i->ptr; i++)
              free_sexpr(*i);
      if(sexp.ptr)
          free(sexp.ptr);
  }
  
  #define atomeq(atom, str) (atom.type==ATOM && !strcmp(str,(char *)atom.ptr))
#+END_SRC

**** Printing

Printing function is simple and prints the AST in a human readable form.

#+BEGIN_SRC C 
  void print_sexpr(SExpr sexp){
      if(sexp.type==ATOM)
          printf("%s",(char *)sexp.ptr);
      else if(sexp.type==LIST) {
          printf("(");
          for (SExpr *i = (SExpr *) sexp.ptr; i->ptr; i++) {
              if(i!=sexp.ptr)
                  printf(" ");
              print_sexpr(*i);
          }
          printf(")");
      }
  }
  void prints(SExpr sexp){
      print_sexpr(sexp);
      printf("\n");
  }
#+END_SRC

*** Parser
:PROPERTIES:
:HEADER-ARGS: :tangle src/parser.c :comments both :exports both :mkdirp yes
:END:

Parser is implemented using recursive descent parser. It is as simple as
possible and does not support any error recovery. It should be able to parse correct
programs, but it is not guaranteed to parse incorrect programs.

Context free grammar used to implement parser:
#+BEGIN_SRC C
  #include <wctype.h>
  #include "ast.h"

  SExpr parse_expr(char ** str);
  SExpr parse_list(char ** str);
  SExpr parse_atom(char ** str);
  SExpr parse(char *s){
      size_t l=strlen(s);
      char *ostr=(char *)malloc(l+1);
      char *str=ostr;
      strcpy(str,s);
      str[l]=0;
      SExpr ast= parse_expr(&str);
      free(ostr);
      return ast;
  }

  #define LISP(str) parse(#str)
#+END_SRC
  - Expression = Atom | List
#+BEGIN_SRC C
  SExpr parse_expr(char ** str){
      for(;iswspace(**str);(*str)++);
      if(**str=='(')
          return parse_list(str);
      else
          return parse_atom(str);
  }
#+END_SRC
  - Atom = string | symbol
    - string = '"' {any character except '"' } | '\\' {any character} '"'
    - symbol = {any character except '(', ')', ' ', '\t', '\n', '\r'}
#+BEGIN_SRC C
  SExpr parse_atom(char ** str){
      size_t i;
      SExpr atom;
      atom.type=ATOM;
      switch (**str) {
      case '"':
          for(i=1;(*str)[i]!='"';i++)
              if((*str)[i]=='\\')
                  i++;
          i++;
          atom.ptr=malloc(i+1);
          strncpy((char *)atom.ptr,*str,i);
          ((char *)atom.ptr)[i]=0;
          (*str)+=i;
          return atom;
      default:
          for (i=0; !iswspace((*str)[i])&&(*str)[i]!=')'&&(*str)[i]!='('; i++);
          atom.ptr=malloc(i+1);
          strncpy((char *)atom.ptr,*str,i);
          ((char *)atom.ptr)[i]=0;
          (*str)+=i;
          return atom;
      }
  }
#+END_SRC
  List = "(" Expression* ")"
#+BEGIN_SRC C
  SExpr parse_list(char **str){
      (*str)++;
      SExpr list;
      list.type=LIST;
      size_t a_len=0;
      size_t m_len=1;
      list.ptr= malloc(m_len*sizeof(SExpr)+1);
      while(1){
          for(;iswspace(**str);(*str)++);
          if(**str==')'){
              (*str)++;
              SExpr nil;
              nil.type=LIST;
              nil.ptr=0;
              ((SExpr *)list.ptr)[a_len]=nil;
              return list;
          }
          ((SExpr *)list.ptr)[a_len]= parse_expr(str);
          a_len++;
          if(a_len==m_len){
              m_len*=2;
              list.ptr= realloc(list.ptr,m_len*sizeof(SExpr)+1);
          }
      }
  }
#+END_SRC

