doc/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-24 Tue 23:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>slang - S-Expression languages frontend</title>
<meta name="author" content="kostdani" />
<meta name="description" content="Compiler frontend for S-Expression languages tageting LLVM IR" />
<meta name="keywords" content="llvm, s-expression, compiler, scheme, lisp, c" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">slang - S-Expression languages frontend</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5913447">1. Introduction</a></li>
<li><a href="#orgfcafd18">2. Languages</a>
<ul>
<li><a href="#org91386f3">2.1. SEIR</a>
<ul>
<li><a href="#orgaf2e409">2.1.1. Src</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5913447" class="outline-2">
<h2 id="org5913447"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Slang is a compiler frontend for S-Expression languages targeting LLVM IR. It
is written in C and uses LLVM C API. It is designed to be used as a CLI tool.
</p>
</div>
</div>

<div id="outline-container-orgfcafd18" class="outline-2">
<h2 id="orgfcafd18"><span class="section-number-2">2.</span> Languages</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org91386f3" class="outline-3">
<h3 id="org91386f3"><span class="section-number-3">2.1.</span> SEIR</h3>
<div class="outline-text-3" id="text-2-1">
<p>
SEIR stands for S-Expression Intermediate Representation. It is designed
to have s-expression syntax and as close to LLVM IR semantics as possible.
It is not intended to be used directly, but rather as a target language for
other S-Expression languages which they can be transformed to using macros.
Something liek assembly of lisps.
</p>
</div>

<div id="outline-container-orgaf2e409" class="outline-4">
<h4 id="orgaf2e409"><span class="section-number-4">2.1.1.</span> Src</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="orgc712781"></a>AST<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
Abstract syntax tree is maximally simplified. There are 2 types of nodes:
</p>
<ul class="org-ul">
<li>LIST - list of nodes</li>
<li>ATOM - atom node (leaf) storing a string</li>
</ul>

<div class="org-src-container">
<pre class="src src-C">#pragma once
#include &lt;stdio.h&gt;
#include &lt;string.h&gt;
#include &lt;malloc.h&gt;

typedef struct s_expr{
    enum{
        LIST,
        ATOM
    } type;
    void * ptr;
} SExpr;

void free_sexpr(SExpr sexp){
    if(sexp.type==LIST)
        for (SExpr *i = (SExpr *) sexp.ptr; i-&gt;ptr; i++)
            free_sexpr(*i);
    if(sexp.ptr)
        free(sexp.ptr);
}

#define atomeq(atom, str) (atom.type==ATOM &amp;&amp; !strcmp(str,(char *)atom.ptr))
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgce38532"></a>Printing<br />
<div class="outline-text-6" id="text-2-1-1-1-1">
<p>
Printing function is simple and prints the AST in a human readable form.
</p>

<div class="org-src-container">
<pre class="src src-C">void print_sexpr(SExpr sexp){
    if(sexp.type==ATOM)
        printf("%s",(char *)sexp.ptr);
    else if(sexp.type==LIST) {
        printf("(");
        for (SExpr *i = (SExpr *) sexp.ptr; i-&gt;ptr; i++) {
            if(i!=sexp.ptr)
                printf(" ");
            print_sexpr(*i);
        }
        printf(")");
    }
}
void prints(SExpr sexp){
    print_sexpr(sexp);
    printf("\n");
}
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="orga59c965"></a>Parser<br />
<div class="outline-text-5" id="text-2-1-1-2">
<p>
Parser is implemented using recursive descent parser. It is as simple as
possible and does not support any error recovery. It should be able to parse correct
programs, but it is not guaranteed to parse incorrect programs.
</p>

<p>
Context free grammar used to implement parser:
</p>
<div class="org-src-container">
<pre class="src src-C">#include &lt;wctype.h&gt;
#include "ast.h"

SExpr parse_expr(char ** str);
SExpr parse_list(char ** str);
SExpr parse_atom(char ** str);
SExpr parse(char *s){
    size_t l=strlen(s);
    char *ostr=(char *)malloc(l+1);
    char *str=ostr;
    strcpy(str,s);
    str[l]=0;
    SExpr ast= parse_expr(&amp;str);
    free(ostr);
    return ast;
}

#define LISP(str) parse(#str)
</pre>
</div>
<ul class="org-ul">
<li>Expression = Atom | List</li>
</ul>
<div class="org-src-container">
<pre class="src src-C">SExpr parse_expr(char ** str){
    for(;iswspace(**str);(*str)++);
    if(**str=='(')
        return parse_list(str);
    else
        return parse_atom(str);
}
</pre>
</div>
<ul class="org-ul">
<li>Atom = string | symbol
<ul class="org-ul">
<li>string = '"' {any character except '"' } | '\\' {any character} '"'</li>
<li>symbol = {any character except '(', ')', ' ', '\t', '\n', '\r'}</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-C">SExpr parse_atom(char ** str){
    size_t i;
    SExpr atom;
    atom.type=ATOM;
    switch (**str) {
    case '"':
        for(i=1;(*str)[i]!='"';i++)
            if((*str)[i]=='\\')
                i++;
        i++;
        atom.ptr=malloc(i+1);
        strncpy((char *)atom.ptr,*str,i);
        ((char *)atom.ptr)[i]=0;
        (*str)+=i;
        return atom;
    default:
        for (i=0; !iswspace((*str)[i])&amp;&amp;(*str)[i]!=')'&amp;&amp;(*str)[i]!='('; i++);
        atom.ptr=malloc(i+1);
        strncpy((char *)atom.ptr,*str,i);
        ((char *)atom.ptr)[i]=0;
        (*str)+=i;
        return atom;
    }
}
</pre>
</div>
<p>
List = "(" Expression* ")"
</p>
<div class="org-src-container">
<pre class="src src-C">SExpr parse_list(char **str){
    (*str)++;
    SExpr list;
    list.type=LIST;
    size_t a_len=0;
    size_t m_len=1;
    list.ptr= malloc(m_len*sizeof(SExpr)+1);
    while(1){
        for(;iswspace(**str);(*str)++);
        if(**str==')'){
            (*str)++;
            SExpr nil;
            nil.type=LIST;
            nil.ptr=0;
            ((SExpr *)list.ptr)[a_len]=nil;
            return list;
        }
        ((SExpr *)list.ptr)[a_len]= parse_expr(str);
        a_len++;
        if(a_len==m_len){
            m_len*=2;
            list.ptr= realloc(list.ptr,m_len*sizeof(SExpr)+1);
        }
    }
}
</pre>
</div>
</div>
</li>
