README.org
*** Environment
:PROPERTIES:
:HEADER-ARGS: :tangle src/env.h :comments both :exports both :mkdirp yes
:END:

Environment is implemented as a linked list of name and value pairs. It is
possible to define new variables and functions in the environment. It is also
possible to lookup variables and functions in the environment.

#+BEGIN_SRC C
  #pragma once
  #include <llvm-c/Core.h>
  #include <malloc.h>
  #include <string.h>

  typedef struct env{
      char *name;
      LLVMValueRef value;
      struct env *next;
  } Env;

  Env *global_env=0;

  void add_var(char *name,LLVMValueRef value){
      Env *e=(Env *)malloc(sizeof(Env));
      e->name=name;
      e->value=value;
      e->next=global_env;
      global_env=e;
  }

  LLVMValueRef get_var(char *name){
      for(Env *e=global_env;e;e=e->next)
          if(!strcmp(e->name,name))
              return e->value;
      return 0;
  }

  void free_env(){
      for(Env *e=global_env;e;e=e->next)
          free(e);
  }
#+END_SRC

*** Compiler
:PROPERTIES:
:HEADER-ARGS: :tangle src/compiler.c :comments both :exports both :mkdirp yes
:END:

Compiler is implemented using LLVM C API. It is not very efficient, but it is
easy to use and understand. The goal is to bootstrap the compiler, better compiler
will be implemented later in compiled language itself.

#+BEGIN_SRC C
  #include <llvm-c/Core.h>
  #include <llvm-c/ExecutionEngine.h>
  #include <llvm-c/Target.h>
  #include <llvm-c/Analysis.h>
  #include <llvm-c/BitWriter.h>
  #include <ctype.h>
  #include <stdlib.h>
  #include <string.h>
  #include "ast.h"
  #include "env.h"
#+END_SRC

**** Types

compile type takes SExpr and returns LLVMTypeRef
if SExpr is atom calls compile_atomic_type if SExpr is list calls compile_compound_type

#+BEGIN_SRC C
  LLVMTypeRef compile_atomic_type(SExpr type);
  LLVMTypeRef compile_compound_type(SExpr* type);
  LLVMTypeRef compile_type(SExpr sexp){
      if(sexp.type==ATOM)
          return compile_atomic_type(sexp);
      else if(sexp.type==LIST)
          return compile_compound_type((SExpr *)sexp.ptr);
      return NULL;
  }
#+END_SRC

***** supprted atomic types

atomic type is stored as pair of name and LLVMTypeRef

#+BEGIN_SRC C
  struct{
      char *name;
       LLVMTypeRef (*fn)();
  } types[]={
      {"<i8>",LLVMInt8Type},
      {"<i16>",LLVMInt16Type},
      {"<i32>",LLVMInt32Type},
      {"<i64>",LLVMInt64Type},
      {"<f32>",LLVMFloatType},
      {"<f64>",LLVMDoubleType},
      {"<void>",LLVMVoidType},
      {0,0}
  };
  LLVMTypeRef compile_atomic_type(SExpr sexp){
      for(int i=0;types[i].name;i++)
          if(atomeq(sexp,types[i].name))
              return types[i].fn();
      return 0;
  }
#+END_SRC

***** supported compound types

compound types are stored as pair of name and function that takes list of SExpr and returns LLVMTypeRef

#+BEGIN_SRC C
  LLVMTypeRef compile_ptr(SExpr* list);
  LLVMTypeRef compile_fn(SExpr* list);
  struct{
      char *name;
      LLVMTypeRef (*fn)(SExpr *);
  } compound_types[]={
      {"<ptr>",compile_ptr},
      {"<fn>",compile_fn},
      {0,0}
  };
  LLVMTypeRef compile_compound_type(SExpr* list){
      for(int i=0;compound_types[i].name;i++)
          if(atomeq(list[0],compound_types[i].name))
              return compound_types[i].fn(list);
      return 0;
  }
#+END_SRC

****** pointer type

pointers are defined as list of two elements: first element is name of pointer type, second element is type of pointer
(<ptr> <type>)
(<ptr>) stands for (<ptr> <void>)

#+BEGIN_SRC C
  LLVMTypeRef compile_ptr(SExpr* list){
        if(list[1].ptr==0)
            return LLVMPointerType(LLVMVoidType(),0);
        LLVMTypeRef t=compile_type(list[1]);
        if(!t)
            t=LLVMVoidType();
        return LLVMPointerType(t,0);
    }
#+END_SRC

****** function type

functions are defined as list of two or more elements: first element is name of function type, second element is return type of function, rest of elements are types of arguments
(<fn> <return type> <arg1 type> <arg2 type> ...)
(<fn>) stands for (<fn> <void>)

#+BEGIN_SRC C
  LLVMTypeRef compile_fn(SExpr* list){
        LLVMTypeRef ret=compile_type(list[1]);
        if(!ret)
            return LLVMFunctionType(LLVMVoidType(),0,0,0);
        LLVMTypeRef *args=0;
        size_t argn;
        for(argn=0;list[argn+2].ptr;argn++);
        args=malloc(argn*sizeof(LLVMTypeRef));
        for(size_t i=0;i<argn;i++)
            args[i]=compile_type(list[i+2]);
        LLVMTypeRef fn=LLVMFunctionType(ret,args,argn,0);
        free(args);
        return fn;
    }
#+END_SRC

