doc/README.html

<li><a id="org94ea1c5"></a>Environment<br />
<div class="outline-text-5" id="text-2-1-1-3">
<p>
Environment is implemented as a linked list of name and value pairs. It is
possible to define new variables and functions in the environment. It is also
possible to lookup variables and functions in the environment.
</p>

<div class="org-src-container">
<pre class="src src-C">#pragma once
#include &lt;llvm-c/Core.h&gt;
#include &lt;malloc.h&gt;
#include &lt;string.h&gt;

typedef struct env{
    char *name;
    LLVMValueRef value;
    struct env *next;
} Env;

Env *global_env=0;

void add_var(char *name,LLVMValueRef value){
    Env *e=(Env *)malloc(sizeof(Env));
    e-&gt;name=name;
    e-&gt;value=value;
    e-&gt;next=global_env;
    global_env=e;
}

LLVMValueRef get_var(char *name){
    for(Env *e=global_env;e;e=e-&gt;next)
        if(!strcmp(e-&gt;name,name))
            return e-&gt;value;
    return 0;
}

void free_env(){
    for(Env *e=global_env;e;e=e-&gt;next)
        free(e);
}
</pre>
</div>
</div>
</li>

<li><a id="org63aa2c1"></a>Compiler<br />
<div class="outline-text-5" id="text-2-1-1-4">
<p>
Compiler is implemented using LLVM C API. It is not very efficient, but it is
easy to use and understand. The goal is to bootstrap the compiler, better compiler
will be implemented later in compiled language itself.
</p>

<div class="org-src-container">
<pre class="src src-C">#include &lt;llvm-c/Core.h&gt;
#include &lt;llvm-c/ExecutionEngine.h&gt;
#include &lt;llvm-c/Target.h&gt;
#include &lt;llvm-c/Analysis.h&gt;
#include &lt;llvm-c/BitWriter.h&gt;
#include &lt;ctype.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;string.h&gt;
#include "ast.h"
#include "env.h"
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org2e40b31"></a>Types<br />
<div class="outline-text-6" id="text-2-1-1-4-1">
<p>
compile type takes SExpr and returns LLVMTypeRef
if SExpr is atom calls compile<sub>atomic</sub><sub>type</sub> if SExpr is list calls compile<sub>compound</sub><sub>type</sub>
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMTypeRef compile_atomic_type(SExpr type);
LLVMTypeRef compile_compound_type(SExpr* type);
LLVMTypeRef compile_type(SExpr sexp){
    if(sexp.type==ATOM)
        return compile_atomic_type(sexp);
    else if(sexp.type==LIST)
        return compile_compound_type((SExpr *)sexp.ptr);
    return NULL;
}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org656a03c"></a>supprted atomic types<br />
<div class="outline-text-7" id="text-2-1-1-4-1-1">
<p>
atomic type is stored as pair of name and LLVMTypeRef
</p>

<div class="org-src-container">
<pre class="src src-C">struct{
    char *name;
     LLVMTypeRef (*fn)();
} types[]={
    {"&lt;i8&gt;",LLVMInt8Type},
    {"&lt;i16&gt;",LLVMInt16Type},
    {"&lt;i32&gt;",LLVMInt32Type},
    {"&lt;i64&gt;",LLVMInt64Type},
    {"&lt;f32&gt;",LLVMFloatType},
    {"&lt;f64&gt;",LLVMDoubleType},
    {"&lt;void&gt;",LLVMVoidType},
    {0,0}
};
LLVMTypeRef compile_atomic_type(SExpr sexp){
    for(int i=0;types[i].name;i++)
        if(atomeq(sexp,types[i].name))
            return types[i].fn();
    return 0;
}
</pre>
</div>
</div>
</li>

<li><a id="org95360b7"></a>supported compound types<br />
<div class="outline-text-7" id="text-2-1-1-4-1-2">
<p>
compound types are stored as pair of name and function that takes list of SExpr and returns LLVMTypeRef
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMTypeRef compile_ptr(SExpr* list);
LLVMTypeRef compile_fn(SExpr* list);
struct{
    char *name;
    LLVMTypeRef (*fn)(SExpr *);
} compound_types[]={
    {"&lt;ptr&gt;",compile_ptr},
    {"&lt;fn&gt;",compile_fn},
    {0,0}
};
LLVMTypeRef compile_compound_type(SExpr* list){
    for(int i=0;compound_types[i].name;i++)
        if(atomeq(list[0],compound_types[i].name))
            return compound_types[i].fn(list);
    return 0;
}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org2fbc317"></a>pointer type<br />
<div class="outline-text-8" id="text-2-1-1-4-1-2-1">
<p>
pointers are defined as list of two elements: first element is name of pointer type, second element is type of pointer
(&lt;ptr&gt; &lt;type&gt;)
(&lt;ptr&gt;) stands for (&lt;ptr&gt; &lt;void&gt;)
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMTypeRef compile_ptr(SExpr* list){
      if(list[1].ptr==0)
          return LLVMPointerType(LLVMVoidType(),0);
      LLVMTypeRef t=compile_type(list[1]);
      if(!t)
          t=LLVMVoidType();
      return LLVMPointerType(t,0);
  }
</pre>
</div>
</div>
</li>

<li><a id="orga09be68"></a>function type<br />
<div class="outline-text-8" id="text-2-1-1-4-1-2-2">
<p>
functions are defined as list of two or more elements: first element is name of function type, second element is return type of function, rest of elements are types of arguments
(&lt;fn&gt; &lt;return type&gt; &lt;arg1 type&gt; &lt;arg2 type&gt; &#x2026;)
(&lt;fn&gt;) stands for (&lt;fn&gt; &lt;void&gt;)
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMTypeRef compile_fn(SExpr* list){
      LLVMTypeRef ret=compile_type(list[1]);
      if(!ret)
          return LLVMFunctionType(LLVMVoidType(),0,0,0);
      LLVMTypeRef *args=0;
      size_t argn;
      for(argn=0;list[argn+2].ptr;argn++);
      args=malloc(argn*sizeof(LLVMTypeRef));
      for(size_t i=0;i&lt;argn;i++)
          args[i]=compile_type(list[i+2]);
      LLVMTypeRef fn=LLVMFunctionType(ret,args,argn,0);
      free(args);
      return fn;
  }
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</li>
