src/compiler.c
/* Compiler */

/* Compiler is implemented using LLVM C API. It is not very efficient, but it is */
/* easy to use and understand. The goal is to bootstrap the compiler, better compiler */
/* will be implemented later in compiled language itself. */


/* [[file:../README.org::*Compiler][Compiler:1]] */
#include <llvm-c/Core.h>
#include <llvm-c/ExecutionEngine.h>
#include <llvm-c/Target.h>
#include <llvm-c/Analysis.h>
#include <llvm-c/BitWriter.h>
#include <ctype.h>
#include <stdlib.h>
#include <string.h>
#include "ast.h"
#include "env.h"
/* Compiler:1 ends here */

/* Types */

/* compile type takes SExpr and returns LLVMTypeRef */
/* if SExpr is atom calls compile_atomic_type if SExpr is list calls compile_compound_type */


/* [[file:../README.org::*Types][Types:1]] */
LLVMTypeRef compile_atomic_type(SExpr type);
LLVMTypeRef compile_compound_type(SExpr* type);
LLVMTypeRef compile_type(SExpr sexp){
    if(sexp.type==ATOM)
        return compile_atomic_type(sexp);
    else if(sexp.type==LIST)
        return compile_compound_type((SExpr *)sexp.ptr);
    return NULL;
}
/* Types:1 ends here */

/* supprted atomic types */

/* atomic type is stored as pair of name and LLVMTypeRef */


/* [[file:../README.org::*supprted atomic types][supprted atomic types:1]] */
struct{
    char *name;
     LLVMTypeRef (*fn)();
} types[]={
    {"<i8>",LLVMInt8Type},
    {"<i16>",LLVMInt16Type},
    {"<i32>",LLVMInt32Type},
    {"<i64>",LLVMInt64Type},
    {"<f32>",LLVMFloatType},
    {"<f64>",LLVMDoubleType},
    {"<void>",LLVMVoidType},
    {0,0}
};
LLVMTypeRef compile_atomic_type(SExpr sexp){
    for(int i=0;types[i].name;i++)
        if(atomeq(sexp,types[i].name))
            return types[i].fn();
    return 0;
}
/* supprted atomic types:1 ends here */

/* supported compound types */

/* compound types are stored as pair of name and function that takes list of SExpr and returns LLVMTypeRef */


/* [[file:../README.org::*supported compound types][supported compound types:1]] */
LLVMTypeRef compile_ptr(SExpr* list);
LLVMTypeRef compile_fn(SExpr* list);
struct{
    char *name;
    LLVMTypeRef (*fn)(SExpr *);
} compound_types[]={
    {"<ptr>",compile_ptr},
    {"<fn>",compile_fn},
    {0,0}
};
LLVMTypeRef compile_compound_type(SExpr* list){
    for(int i=0;compound_types[i].name;i++)
        if(atomeq(list[0],compound_types[i].name))
            return compound_types[i].fn(list);
    return 0;
}
/* supported compound types:1 ends here */

/* pointer type */

/* pointers are defined as list of two elements: first element is name of pointer type, second element is type of pointer */
/* (<ptr> <type>) */
/* (<ptr>) stands for (<ptr> <void>) */


/* [[file:../README.org::*pointer type][pointer type:1]] */
LLVMTypeRef compile_ptr(SExpr* list){
      if(list[1].ptr==0)
          return LLVMPointerType(LLVMVoidType(),0);
      LLVMTypeRef t=compile_type(list[1]);
      if(!t)
          t=LLVMVoidType();
      return LLVMPointerType(t,0);
  }
/* pointer type:1 ends here */

/* function type */

/* functions are defined as list of two or more elements: first element is name of function type, second element is return type of function, rest of elements are types of arguments */
/* (<fn> <return type> <arg1 type> <arg2 type> ...) */
/* (<fn>) stands for (<fn> <void>) */


/* [[file:../README.org::*function type][function type:1]] */
LLVMTypeRef compile_fn(SExpr* list){
      LLVMTypeRef ret=compile_type(list[1]);
      if(!ret)
          return LLVMFunctionType(LLVMVoidType(),0,0,0);
      LLVMTypeRef *args=0;
      size_t argn;
      for(argn=0;list[argn+2].ptr;argn++);
      args=malloc(argn*sizeof(LLVMTypeRef));
      for(size_t i=0;i<argn;i++)
          args[i]=compile_type(list[i+2]);
      LLVMTypeRef fn=LLVMFunctionType(ret,args,argn,0);
      free(args);
      return fn;
  }
/* function type:1 ends here */

/* Values */
