README.org
**** Values

Values are either numbers, strings, or symbols.
numbers or compiled to LLVM constants, strings are compiled to LLVM global strings, and are looked up in the environment.

#+BEGIN_SRC C
  LLVMValueRef compile_value(SExpr sexp){
      if(sexp.type==ATOM){
          if(isdigit(*(char *)sexp.ptr))
              return LLVMConstInt(LLVMInt32Type(),atoi((char *)sexp.ptr),0);
          else if(*(char *)sexp.ptr=='"')
              return LLVMConstString((char *)sexp.ptr+1,strlen((char *)sexp.ptr)-2,0);
          else
              return get_var((char *)sexp.ptr);
      }
      printf("unknown value: \n");
      prints(sexp);
      return 0;
  }
#+END_SRC

**** Instructions

instruction compiler functions are named compile_<instruction>
implemented as functions that take a pointer to builder and a pointer to the instruction list and return a pointer to the last instruction

#+BEGIN_SRC C
  LLVMValueRef compile_ret(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_br(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_add(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_sub(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_mul(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_sdiv(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_udiv(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_call(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_store(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_load(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_phi(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_cast(LLVMBuilderRef builder,SExpr* sexp);
  LLVMValueRef compile_assign(LLVMBuilderRef builder,SExpr* sexp);
  struct instruction{
      char *name;
      LLVMValueRef (*compile)(LLVMBuilderRef,SExpr*);
  }   instructions[]={
      {"ret",compile_ret},
      {"br",compile_br},
      {"add",compile_add},
      {"sub",compile_sub},
      {"mul",compile_mul},
      {"sdiv",compile_sdiv},
      {"udiv",compile_udiv},
      {"call",compile_call},
      {"store",compile_store},
      {"load",compile_load},
      {"phi",compile_phi},
      {"cast",compile_cast},
      {"assign",compile_assign},
      {0,0}
  };
  LLVMValueRef compile_instr(LLVMBuilderRef builder,SExpr* sexp){
      for(size_t i=0;instructions[i].name;i++)
          if(!strcmp(sexp[0].ptr,instructions[i].name))
              return instructions[i].compile(builder,sexp);
      return 0;
  }
#+END_SRC

***** Return

syntax: (ret value) or (ret) for void

#+BEGIN_SRC C 
  LLVMValueRef compile_ret(LLVMBuilderRef builder,SExpr *sexp){
      if(sexp[1].ptr==0)
          return LLVMBuildRetVoid(builder);
      else
          return LLVMBuildRet(builder,compile_value(sexp[1]));
  }
#+END_SRC

***** Branch

syntax: (br cond label1 label2) or (br label) for unconditional branch

#+BEGIN_SRC C 
  LLVMValueRef compile_br(LLVMBuilderRef builder,SExpr* sexp){
      if(sexp[3].ptr)
          return LLVMBuildCondBr(builder,compile_value(sexp[1]),
                                 (LLVMBasicBlockRef)compile_value(sexp[2]),
                                 (LLVMBasicBlockRef)compile_value(sexp[3]));
      else
          return LLVMBuildBr(builder,(LLVMBasicBlockRef)compile_value(sexp[1]));
  }
#+END_SRC

***** Add

syntax: (add value1 value2)

#+BEGIN_SRC C 
  LLVMValueRef compile_add(LLVMBuilderRef builder,SExpr* sexp){
      return LLVMBuildAdd(builder,compile_value(sexp[2]),
                                 compile_value(sexp[3]),
                                 (char *)sexp[0].ptr);
  }
#+END_SRC

***** Sub

syntax: (sub value1 value2)

#+BEGIN_SRC C 
  LLVMValueRef compile_sub(LLVMBuilderRef builder,SExpr* sexp){
      return LLVMBuildSub(builder,compile_value(sexp[1]),
                                 compile_value(sexp[2]),
                                 (char *)sexp[0].ptr);
  }
#+END_SRC

***** Mul

syntax: (mul value1 value2)

#+BEGIN_SRC C
  LLVMValueRef compile_mul(LLVMBuilderRef builder,SExpr* sexp){
      return LLVMBuildMul(builder,compile_value(sexp[1]),
                                 compile_value(sexp[2]),
                                 (char *)sexp[0].ptr);
  }
#+END_SRC

***** Signed Div

syntax: (sdiv value1 value2)

#+BEGIN_SRC C 
  LLVMValueRef compile_sdiv(LLVMBuilderRef builder,SExpr* sexp){
      return LLVMBuildSDiv(builder,compile_value(sexp[1]),
                                 compile_value(sexp[2]),
                                 (char *)sexp[0].ptr);
  }
#+END_SRC

***** Unsigned Div

syntax: (udiv value1 value2)

#+BEGIN_SRC C 
  LLVMValueRef compile_udiv(LLVMBuilderRef builder,SExpr* sexp){
      return LLVMBuildUDiv(builder,compile_value(sexp[1]),
                                 compile_value(sexp[2]),
                                 (char *)sexp[0].ptr);
  }
#+END_SRC

