doc/README.html

<li><a id="orgb99c137"></a>Values<br />
<div class="outline-text-6" id="text-2-1-1-4-2">
<p>
Values are either numbers, strings, or symbols.
numbers or compiled to LLVM constants, strings are compiled to LLVM global strings, and are looked up in the environment.
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_value(SExpr sexp){
    if(sexp.type==ATOM){
        if(isdigit(*(char *)sexp.ptr))
            return LLVMConstInt(LLVMInt32Type(),atoi((char *)sexp.ptr),0);
        else if(*(char *)sexp.ptr=='"')
            return LLVMConstString((char *)sexp.ptr+1,strlen((char *)sexp.ptr)-2,0);
        else
            return get_var((char *)sexp.ptr);
    }
    printf("unknown value: \n");
    prints(sexp);
    return 0;
}
</pre>
</div>
</div>
</li>

<li><a id="org10e0285"></a>Instructions<br />
<div class="outline-text-6" id="text-2-1-1-4-3">
<p>
instruction compiler functions are named compile_&lt;instruction&gt;
implemented as functions that take a pointer to builder and a pointer to the instruction list and return a pointer to the last instruction
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_add(LLVMBuilderRef builder,SExpr* sexp);
LLVMValueRef compile_sub(LLVMBuilderRef builder,SExpr* sexp);
LLVMValueRef compile_mul(LLVMBuilderRef builder,SExpr* sexp);
LLVMValueRef compile_div(LLVMBuilderRef builder,SExpr* sexp);
LLVMValueRef compile_call(LLVMBuilderRef builder,SExpr* sexp);
LLVMValueRef compile_store(LLVMBuilderRef builder,SExpr* sexp);
LLVMValueRef compile_load(LLVMBuilderRef builder,SExpr* sexp);
LLVMValueRef compile_phi(LLVMBuilderRef builder,SExpr* sexp);
LLVMValueRef compile_cast(LLVMBuilderRef builder,SExpr* sexp);
LLVMValueRef compile_assign(LLVMBuilderRef builder,SExpr* sexp);
struct instruction{
    char *name;
    LLVMValueRef (*compile)(LLVMBuilderRef,SExpr*);
}   instructions[]={
    {"add",compile_add},
    {"sub",compile_sub},
    {"mul",compile_mul},
    {"div",compile_div},
    {"call",compile_call},
    {"store",compile_store},
    {"load",compile_load},
    {"phi",compile_phi},
    {"cast",compile_cast},
    {"assign",compile_assign},
    {0,0}
};
LLVMValueRef compile_instr(LLVMBuilderRef builder,SExpr* sexp){
    for(size_t i=0;instructions[i].name;i++)
        if(!strcmp(sexp[0].ptr,instructions[i].name))
            return instructions[i].compile(builder,sexp);
    return 0;
}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgc7be2d2"></a>Return<br />
<div class="outline-text-7" id="text-2-1-1-4-3-1">
<p>
syntax: (ret value) or (ret) for void
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_ret(LLVMBuilderRef *builder,SExpr *sexp){
    if(sexp[1].ptr==0)
        return LLVMBuildRetVoid(*builder);
    else
        return LLVMBuildRet(*builder,compile_value(sexp[1]));
}
</pre>
</div>
</div>
</li>

<li><a id="org6c10781"></a>Branch<br />
<div class="outline-text-7" id="text-2-1-1-4-3-2">
<p>
syntax: (br cond label1 label2) or (br label) for unconditional branch
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_br(LLVMBuilderRef builder,SExpr* sexp){
    if(sexp[3].ptr)
        return LLVMBuildCondBr(builder,compile_value(sexp[1]),
                               (LLVMBasicBlockRef)compile_value(sexp[2]),
                               (LLVMBasicBlockRef)compile_value(sexp[3]));
    else
        return LLVMBuildBr(builder,(LLVMBasicBlockRef)compile_value(sexp[1]));
}
</pre>
</div>
</div>
</li>

<li><a id="org1013c1f"></a>Add<br />
<div class="outline-text-7" id="text-2-1-1-4-3-3">
<p>
syntax: (add value1 value2)
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_add(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildAdd(builder,compile_value(sexp[2]),
                               compile_value(sexp[3]),
                               (char *)sexp[0].ptr);
}
</pre>
</div>
</div>
</li>

<li><a id="org7bd2cfb"></a>Sub<br />
<div class="outline-text-7" id="text-2-1-1-4-3-4">
<p>
syntax: (sub value1 value2)
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_sub(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildSub(builder,compile_value(sexp[1]),
                               compile_value(sexp[2]),
                               (char *)sexp[0].ptr);
}
</pre>
</div>
</div>
</li>

<li><a id="org498fcd0"></a>Mul<br />
<div class="outline-text-7" id="text-2-1-1-4-3-5">
<p>
syntax: (mul value1 value2)
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_mul(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildMul(builder,compile_value(sexp[1]),
                               compile_value(sexp[2]),
                               (char *)sexp[0].ptr);
}
</pre>
</div>
</div>
</li>
