doc/README.html

<li><a id="org926f9b0"></a>Div<br />
<div class="outline-text-7" id="text-2-1-1-4-3-6">
<p>
syntax: (div value1 value2)
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_sdiv(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildSDiv(builder,compile_value(sexp[1]),
                               compile_value(sexp[2]),
                               (char *)sexp[0].ptr);
}
</pre>
</div>
</div>
</li>

<li><a id="org743017e"></a>Call<br />
<div class="outline-text-7" id="text-2-1-1-4-3-7">
<p>
syntax: (call fn arg1 arg2 &#x2026;)
fn is a function name or a function pointer
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_call(LLVMBuilderRef builder,SExpr* sexp){
    LLVMValueRef fn=compile_value(sexp[1]);
    LLVMValueRef *args=0;
    size_t argn;
    for(argn=0;sexp[argn+2].ptr;argn++);
    args=malloc(argn*sizeof(LLVMValueRef));
    for(size_t i=0;i&lt;argn;i++)
        args[i]=compile_value(sexp[i+2]);
    // using LLVMBuildCall2 to avoid warning
    LLVMValueRef call=LLVMBuildCall2(builder,LLVMGetElementType(LLVMTypeOf(fn)),fn,args,argn,"call");
    free(args);
    return call;
}
</pre>
</div>
</div>
</li>

<li><a id="org510b2d4"></a>Store<br />
<div class="outline-text-7" id="text-2-1-1-4-3-8">
<p>
syntax: (store value ptr)
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_store(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildStore(builder,compile_value(sexp[1]),compile_value(sexp[2]));
}
</pre>
</div>
</div>
</li>

<li><a id="org29ea1d6"></a>Load<br />
<div class="outline-text-7" id="text-2-1-1-4-3-9">
<p>
syntax: (load ptr)
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_load(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildLoad2(builder,LLVMGetElementType(LLVMTypeOf(compile_value(sexp[1]))),compile_value(sexp[1]),"load");
}
</pre>
</div>
</div>
</li>

<li><a id="orgd4b1f65"></a>Phi<br />
<div class="outline-text-7" id="text-2-1-1-4-3-10">
<p>
syntax: (phi type (value1 label1) (value2 label2) &#x2026;)
type is the type of the phi node
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_phi(LLVMBuilderRef builder,SExpr* sexp){
    LLVMTypeRef type=compile_type(sexp[1]);
    LLVMValueRef phi=LLVMBuildPhi(builder,type,"phi");
    size_t argn;
    for(argn=0;sexp[argn+2].ptr;argn++);
    LLVMValueRef *values=malloc(argn*sizeof(LLVMValueRef));
    LLVMBasicBlockRef *labels=malloc(argn*sizeof(LLVMBasicBlockRef));
    for(size_t i=0;i&lt;argn;i++){
        values[i]=compile_value(((SExpr *)(sexp[i+2].ptr))[0]);
        labels[i]=(LLVMBasicBlockRef)compile_value(((SExpr *)(sexp[i+2].ptr))[1]);
    }
    LLVMAddIncoming(phi,values,labels,argn);
    free(values);
    free(labels);
    return phi;
}
</pre>
</div>
</div>
</li>

<li><a id="org71b8c6c"></a>Cast<br />
<div class="outline-text-7" id="text-2-1-1-4-3-11">
<p>
syntax: (cast type value)
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_cast(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildBitCast(builder,compile_value(sexp[2]),compile_type(sexp[1]),"cast");
}
</pre>
</div>
</div>
</li>

<li><a id="org0d43747"></a>Define<br />
<div class="outline-text-7" id="text-2-1-1-4-3-12">
<p>
syntax: (def name value) or (def name (instruction &#x2026;))
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMValueRef compile_assign(LLVMBuilderRef builder,SExpr* sexp){
    LLVMValueRef value;
    if(sexp[2].type==ATOM)
        value=compile_value(sexp[2]);
    else
        value=compile_instr(builder,(SExpr *)(sexp[2].ptr));
    add_var((char *)sexp[1].ptr,value);
    return value;
}
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="orgad37353"></a>Blocks<br />
<div class="outline-text-6" id="text-2-1-1-4-4">
<p>
Syntax: (block name (instruction &#x2026;) &#x2026;)
</p>

<div class="org-src-container">
<pre class="src src-C">void compile_block(LLVMValueRef function,SExpr sexp){
    if(sexp.type==LIST){
        SExpr *list=(SExpr *)sexp.ptr;
        if(atomeq(list[0],"block")){
            LLVMBuilderRef builder=LLVMCreateBuilder();
            LLVMBasicBlockRef block=LLVMAppendBasicBlock(function,(char *)list[1].ptr);
            LLVMPositionBuilderAtEnd(builder,block);
            for(SExpr *i=list+2;i-&gt;ptr;i++)
                compile_instr(builder,(SExpr *)i-&gt;ptr);
        }
    }
}
</pre>
</div>
</div>
</li>

<li><a id="org8394554"></a>Globals<br />
<div class="outline-text-6" id="text-2-1-1-4-5">
<p>
Only functions are implemented for now.
function syntax: (function ((name &lt;return type&gt;) (arg1 &lt;type&gt;) (arg2 &lt;type&gt;) &#x2026;) (block &#x2026;) &#x2026;)
</p>

<div class="org-src-container">
<pre class="src src-C">void compile_global(LLVMModuleRef module,SExpr sexp){
    if(sexp.type==LIST){
        SExpr *list=(SExpr *)sexp.ptr;
        if(atomeq(list[0],"function")){
            SExpr *signatures=(SExpr *)list[1].ptr;
            char *name;
            LLVMTypeRef rettype;
            if(signatures[0].type==LIST) {
                SExpr *namesig = (SExpr *) signatures[0].ptr;
                name = (char *) namesig[0].ptr;
                rettype = compile_type(namesig[1]);
            } else{
                name=(char *)signatures[0].ptr;
                rettype=LLVMVoidType();
            }
            size_t n_args=0;
            for(SExpr *i=signatures+1;i-&gt;ptr;i++)
                n_args++;
            LLVMTypeRef *argtypes=malloc(n_args*sizeof(LLVMTypeRef));
            for(size_t i=0;i&lt;n_args;i++)
                argtypes[i]=compile_type(((SExpr *)signatures[i+1].ptr)[1]);
            LLVMTypeRef functype=LLVMFunctionType(rettype,argtypes,n_args,0);
            LLVMValueRef function=LLVMAddFunction(module,name,functype);
            for(size_t i=0;i&lt;n_args;i++){
                LLVMValueRef arg=LLVMGetParam(function,i);
                LLVMSetValueName(arg,((char *)(((SExpr *)signatures[i+1].ptr)[0].ptr)));
            }
            for(SExpr *body=list+2;body-&gt;ptr;body++)
                compile_block(function,*body);
            free(argtypes);
        }
    }
}
</pre>
</div>
</div>
</li>
