src/compiler.c

/* syntax: (call fn arg1 arg2 ...) */
/* fn is a function name or a function pointer */


/* [[file:../README.org::*Call][Call:1]] */
LLVMValueRef compile_call(LLVMBuilderRef builder,SExpr* sexp){
    LLVMValueRef fn=compile_value(sexp[1]);
    LLVMValueRef *args=0;
    size_t argn;
    for(argn=0;sexp[argn+2].ptr;argn++);
    args=malloc(argn*sizeof(LLVMValueRef));
    for(size_t i=0;i<argn;i++)
        args[i]=compile_value(sexp[i+2]);
    // using LLVMBuildCall2 to avoid warning
    LLVMValueRef call=LLVMBuildCall2(builder,LLVMGetElementType(LLVMTypeOf(fn)),fn,args,argn,"call");
    free(args);
    return call;
}
/* Call:1 ends here */

/* Store */

/* syntax: (store value ptr) */


/* [[file:../README.org::*Store][Store:1]] */
LLVMValueRef compile_store(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildStore(builder,compile_value(sexp[1]),compile_value(sexp[2]));
}
/* Store:1 ends here */

/* Load */

/* syntax: (load ptr) */


/* [[file:../README.org::*Load][Load:1]] */
LLVMValueRef compile_load(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildLoad2(builder,LLVMGetElementType(LLVMTypeOf(compile_value(sexp[1]))),compile_value(sexp[1]),"load");
}
/* Load:1 ends here */

/* Phi */

/* syntax: (phi type (value1 label1) (value2 label2) ...) */
/* type is the type of the phi node */


/* [[file:../README.org::*Phi][Phi:1]] */
LLVMValueRef compile_phi(LLVMBuilderRef builder,SExpr* sexp){
    LLVMTypeRef type=compile_type(sexp[1]);
    LLVMValueRef phi=LLVMBuildPhi(builder,type,"phi");
    size_t argn;
    for(argn=0;sexp[argn+2].ptr;argn++);
    LLVMValueRef *values=malloc(argn*sizeof(LLVMValueRef));
    LLVMBasicBlockRef *labels=malloc(argn*sizeof(LLVMBasicBlockRef));
    for(size_t i=0;i<argn;i++){
        values[i]=compile_value(((SExpr *)(sexp[i+2].ptr))[0]);
        labels[i]=(LLVMBasicBlockRef)compile_value(((SExpr *)(sexp[i+2].ptr))[1]);
    }
    LLVMAddIncoming(phi,values,labels,argn);
    free(values);
    free(labels);
    return phi;
}
/* Phi:1 ends here */

/* Cast */

/* syntax: (cast type value) */


/* [[file:../README.org::*Cast][Cast:1]] */
LLVMValueRef compile_cast(LLVMBuilderRef builder,SExpr* sexp){
    return LLVMBuildBitCast(builder,compile_value(sexp[2]),compile_type(sexp[1]),"cast");
}
/* Cast:1 ends here */

/* Define */

/* syntax: (def name value) or (def name (instruction ...)) */


/* [[file:../README.org::*Define][Define:1]] */
LLVMValueRef compile_assign(LLVMBuilderRef builder,SExpr* sexp){
    LLVMValueRef value;
    if(sexp[2].type==ATOM)
        value=compile_value(sexp[2]);
    else
        value=compile_instr(builder,(SExpr *)(sexp[2].ptr));
    add_var((char *)sexp[1].ptr,value);
    return value;
}
/* Define:1 ends here */

/* Blocks */

/* Syntax: (block name (instruction ...) ...) */


/* [[file:../README.org::*Blocks][Blocks:1]] */
void compile_block(LLVMValueRef function,SExpr sexp){
    if(sexp.type==LIST){
        SExpr *list=(SExpr *)sexp.ptr;
        if(atomeq(list[0],"block")){
            LLVMBuilderRef builder=LLVMCreateBuilder();
            LLVMBasicBlockRef block=LLVMAppendBasicBlock(function,(char *)list[1].ptr);
            LLVMPositionBuilderAtEnd(builder,block);
            for(SExpr *i=list+2;i->ptr;i++)
                compile_instr(builder,(SExpr *)i->ptr);
        }
    }
}
/* Blocks:1 ends here */

/* Globals */

/* Only functions are implemented for now. */
/* function syntax: (function ((name <return type>) (arg1 <type>) (arg2 <type>) ...) (block ...) ...) */


/* [[file:../README.org::*Globals][Globals:1]] */
void compile_global(LLVMModuleRef module,SExpr sexp){
    if(sexp.type==LIST){
        SExpr *list=(SExpr *)sexp.ptr;
        if(atomeq(list[0],"function")){
            SExpr *signatures=(SExpr *)list[1].ptr;
            char *name;
            LLVMTypeRef rettype;
            if(signatures[0].type==LIST) {
                SExpr *namesig = (SExpr *) signatures[0].ptr;
                name = (char *) namesig[0].ptr;
                rettype = compile_type(namesig[1]);
            } else{
                name=(char *)signatures[0].ptr;
                rettype=LLVMVoidType();
            }
            size_t n_args=0;
            for(SExpr *i=signatures+1;i->ptr;i++)
                n_args++;
            LLVMTypeRef *argtypes=malloc(n_args*sizeof(LLVMTypeRef));
            for(size_t i=0;i<n_args;i++)
                argtypes[i]=compile_type(((SExpr *)signatures[i+1].ptr)[1]);
            LLVMTypeRef functype=LLVMFunctionType(rettype,argtypes,n_args,0);
            LLVMValueRef function=LLVMAddFunction(module,name,functype);
            for(size_t i=0;i<n_args;i++){
                LLVMValueRef arg=LLVMGetParam(function,i);
                LLVMSetValueName(arg,((char *)(((SExpr *)signatures[i+1].ptr)[0].ptr)));
            }
            for(SExpr *body=list+2;body->ptr;body++)
                compile_block(function,*body);
            free(argtypes);
        }
    }
}
/* Globals:1 ends here */

/* Module */
