README.org
**** Module

syntax: (module name global ...)
where global is a function or a global variable declarations

#+BEGIN_SRC C
  LLVMModuleRef compile_module(SExpr sexp){
      if(sexp.type==LIST){
          SExpr *list=(SExpr *)sexp.ptr;
          if(atomeq(list[0],"module")){
              LLVMModuleRef module=LLVMModuleCreateWithName((char *)list[1].ptr);
              for(SExpr *i=list+2;i->ptr;i++)
                  compile_global(module,*i);
              return module;
          }
      }
      return 0;
  }
#+END_SRC

*** CLI
:PROPERTIES:
:HEADER-ARGS: :tangle src/cli.c :comments both :exports both :mkdirp yes
:END:

Command line interface only supports dumping the LLVM IR.

#+BEGIN_SRC C
  #include "compiler.c"
  #include "parser.c"

  int cli(int argc,char **argv){
      char *infile=0;
      char *outfile=0;
      int dump=0;
      for(int i=1;i<argc;i++){
          if(!strcmp(argv[i],"-o")){
              outfile=argv[++i];
          }else if(!strcmp(argv[i],"-d")){
              dump=1;
          }else{
              infile=argv[i];
          }
      }
      if(!infile){
          printf("usage: %s [args] <file>\n",argv[0]);
          printf("supported args: \n"
                 "-o <file> : output file\n"
                 "-d : dump llvm ir\n");
          return 1;
      }
      // read file
      FILE *f=fopen(infile,"r");
      if(!f){
          printf("could not open file %s\n",infile);
          return 1;
      }
      fseek(f,0,SEEK_END);
      size_t size=ftell(f);
      fseek(f,0,SEEK_SET);
      char *buf=malloc(size+1);
      fread(buf,1,size,f);
      buf[size]=0;
      fclose(f);
      // parse file
      SExpr sexp=parse(buf);
      free(buf);
      // compile
      LLVMModuleRef module=compile_module(sexp);
      free_sexpr(sexp);
      // dump ir
      if(dump){
          LLVMDumpModule(module);
      }
      // compile to file
      if(outfile){
          char *error=0;
          LLVMVerifyModule(module,LLVMReturnStatusAction,&error);
          if(error && strcmp(error,"")){
              printf("error1: %s\n",error);
              return 1;
          }
          LLVMInitializeNativeTarget();
          LLVMTargetRef target;
          char *triple=LLVMGetDefaultTargetTriple();
          LLVMGetTargetFromTriple(triple,&target,&error);
          if(error && strcmp(error,"")){
              printf("error2: %s\n",error);
              return 1;
          }
          char *cpu=LLVMGetHostCPUName();
          char *features=LLVMGetHostCPUFeatures();
          LLVMTargetMachineRef machine=LLVMCreateTargetMachine(target,triple,cpu,features,LLVMCodeGenLevelDefault,LLVMRelocDefault,LLVMCodeModelDefault);
          LLVMTargetDataRef data=LLVMCreateTargetDataLayout(machine);
          LLVMSetModuleDataLayout(module,data);
          LLVMDisposeTargetData(data);
          LLVMDisposeTargetMachine(machine);
          free(cpu);
          free(features);
          free(triple);
          if(0){
              LLVMInitializeNativeTarget();
              LLVMInitializeNativeAsmPrinter();
              LLVMInitializeNativeAsmParser();
              LLVMExecutionEngineRef engine;
              if(LLVMCreateJITCompilerForModule(&engine,module,0,&error)){
                  printf("error: %s\n",error);
                  return 1;
              }
              LLVMRunFunction(engine,LLVMGetNamedFunction(module,"main"),0,0);
              LLVMDisposeExecutionEngine(engine);
          }else{
              LLVMTargetMachineEmitToFile(machine,module,outfile,LLVMObjectFile,0);
          }
      }
      // cleanup
      LLVMDisposeModule(module);
      free_env();
      return 0;

  }
#+END_SRC

*** main
:PROPERTIES:
:HEADER-ARGS: :tangle src/main.c  :comments both :exports both :mkdirp yes
:END:

#+BEGIN_SRC C
  #include "cli.c"
  int main(int argc,char **argv){
      return cli(argc,argv);
  }
#+END_SRC

** Build

*** CMakeLists.txt

#+BEGIN_SRC sh :tangle CMakeLists.txt :comments both :exports both
  cmake_minimum_required(VERSION 3.4.3)
  
  project(slang)

  find_package(LLVM REQUIRED)

  include_directories(${LLVM_INCLUDE_DIRS})
  add_definitions(${LLVM_DEFINITIONS})

  add_executable(slang src/main.c)

  llvm_map_components_to_libnames(llvm_libs support core irreader executionengine interpreter mc nativecodegen)

  target_link_libraries(slang ${llvm_libs})
#+END_SRC

*** build.sh

#+BEGIN_SRC sh :tangle build/build.sh :mkdirp yes :comments both :exports both :shebang #!/bin/sh
  cmake ..
  make
#+END_SRC

** Tests

some simple .seir files

#+BEGIN_SRC lisp :tangle tests/1.seir
  (module test
    (function ((main <i32>))
        (block entry
            (ret 0))))
#+END_SRC

#+BEGIN_SRC lisp :tangle tests/2.seir
  (module test
    (function ((main <i32>) (argc <i32>) (argv (<ptr> (<ptr> <i8>)))))
        (block entry
            (ret argc)))
#+END_SRC

* License

#+BEGIN_SRC md :tangle LICENSE
MIT License

Copyright (c) 2023 kostdani

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
#+END_SRC
