doc/README.html

<li><a id="org1015fb9"></a>Module<br />
<div class="outline-text-6" id="text-2-1-1-4-6">
<p>
syntax: (module name global &#x2026;)
where global is a function or a global variable declarations
</p>

<div class="org-src-container">
<pre class="src src-C">LLVMModuleRef compile_module(SExpr sexp){
    if(sexp.type==LIST){
        SExpr *list=(SExpr *)sexp.ptr;
        if(atomeq(list[0],"module")){
            LLVMModuleRef module=LLVMModuleCreateWithName((char *)list[1].ptr);
            for(SExpr *i=list+2;i-&gt;ptr;i++)
                compile_global(module,*i);
            return module;
        }
    }
    return 0;
}
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="orgd884b2f"></a>CLI<br />
<div class="outline-text-5" id="text-2-1-1-5">
<p>
Command line interface only supports dumping the LLVM IR.
</p>

<div class="org-src-container">
<pre class="src src-C">#include "compiler.c"
#include "parser.c"

int cli(int argc,char **argv){
    char *infile=0;
    char *outfile=0;
    int dump=0;
    for(int i=1;i&lt;argc;i++){
        if(!strcmp(argv[i],"-o")){
            outfile=argv[++i];
        }else if(!strcmp(argv[i],"-d")){
            dump=1;
        }else{
            infile=argv[i];
        }
    }
    if(!infile){
        printf("usage: %s [args] &lt;file&gt;\n",argv[0]);
        printf("supported args: \n"
               "-o &lt;file&gt; : output file\n"
               "-d : dump llvm ir\n");
        return 1;
    }
    // read file
    FILE *f=fopen(infile,"r");
    if(!f){
        printf("could not open file %s\n",infile);
        return 1;
    }
    fseek(f,0,SEEK_END);
    size_t size=ftell(f);
    fseek(f,0,SEEK_SET);
    char *buf=malloc(size+1);
    fread(buf,1,size,f);
    buf[size]=0;
    fclose(f);
    // parse file
    SExpr sexp=parse(buf);
    free(buf);
    // compile
    LLVMModuleRef module=compile_module(sexp);
    free_sexpr(sexp);
    // dump ir
    if(dump){
        LLVMDumpModule(module);
    }
    // compile to file
    if(outfile){
        char *error=0;
        LLVMVerifyModule(module,LLVMReturnStatusAction,&amp;error);
        if(error &amp;&amp; strcmp(error,"")){
            printf("error1: %s\n",error);
            return 1;
        }
        LLVMInitializeNativeTarget();
        LLVMTargetRef target;
        char *triple=LLVMGetDefaultTargetTriple();
        LLVMGetTargetFromTriple(triple,&amp;target,&amp;error);
        if(error &amp;&amp; strcmp(error,"")){
            printf("error2: %s\n",error);
            return 1;
        }
        char *cpu=LLVMGetHostCPUName();
        char *features=LLVMGetHostCPUFeatures();
        LLVMTargetMachineRef machine=LLVMCreateTargetMachine(target,triple,cpu,features,LLVMCodeGenLevelDefault,LLVMRelocDefault,LLVMCodeModelDefault);
        LLVMTargetDataRef data=LLVMCreateTargetDataLayout(machine);
        LLVMSetModuleDataLayout(module,data);
        LLVMDisposeTargetData(data);
        LLVMDisposeTargetMachine(machine);
        free(cpu);
        free(features);
        free(triple);
        if(0){
            LLVMInitializeNativeTarget();
            LLVMInitializeNativeAsmPrinter();
            LLVMInitializeNativeAsmParser();
            LLVMExecutionEngineRef engine;
            if(LLVMCreateJITCompilerForModule(&amp;engine,module,0,&amp;error)){
                printf("error: %s\n",error);
                return 1;
            }
            LLVMRunFunction(engine,LLVMGetNamedFunction(module,"main"),0,0);
            LLVMDisposeExecutionEngine(engine);
        }else{
            LLVMTargetMachineEmitToFile(machine,module,outfile,LLVMObjectFile,0);
        }
    }
    // cleanup
    LLVMDisposeModule(module);
    free_env();
    return 0;

}
</pre>
</div>
</div>
</li>

<li><a id="orgad95db5"></a>main<br />
<div class="outline-text-5" id="text-2-1-1-6">
<div class="org-src-container">
<pre class="src src-C">#include "cli.c"
int main(int argc,char **argv){
    return cli(argc,argv);
}
</pre>
</div>
</div>
</li>

<li><a id="org27a995c"></a>Build<br />
<ol class="org-ol">
<li><a id="org598d0f7"></a>CMakeLists.txt<br />
<div class="outline-text-6" id="text-2-1-1-7-1">
<div class="org-src-container">
<pre class="src src-sh">cmake_minimum_required(VERSION 3.4.3)

project(slang)

find_package(LLVM REQUIRED)

include_directories(${LLVM_INCLUDE_DIRS})
add_definitions(${LLVM_DEFINITIONS})

add_executable(slang src/main.c)

llvm_map_components_to_libnames(llvm_libs support core irreader executionengine interpreter mc nativecodegen)

target_link_libraries(slang ${llvm_libs})
</pre>
</div>
</div>
</li>

<li><a id="org8e7726f"></a>build.sh<br />
<div class="outline-text-6" id="text-2-1-1-7-2">
<div class="org-src-container">
<pre class="src src-sh">cmake ..
make
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: kostdani</p>
<p class="date">Created: 2023-01-24 Tue 23:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
