src/compiler.c

/* syntax: (module name global ...) */
/* where global is a function or a global variable declarations */


/* [[file:../README.org::*Module][Module:1]] */
LLVMModuleRef compile_module(SExpr sexp){
    if(sexp.type==LIST){
        SExpr *list=(SExpr *)sexp.ptr;
        if(atomeq(list[0],"module")){
            LLVMModuleRef module=LLVMModuleCreateWithName((char *)list[1].ptr);
            for(SExpr *i=list+2;i->ptr;i++)
                compile_global(module,*i);
            return module;
        }
    }
    return 0;
}
/* Module:1 ends here */
